       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-YEAR           PIC 9(4).
       77 WS-REMAINDER-4    PIC 9(2).
       77 WS-REMAINDER-400  PIC 9(3).
       77 WS-REMAINDER-100  PIC 9(3).
       77 WS-QUOTIENT       PIC 9(3).

       77 WS-RESULT         PIC 9(1).

       PROCEDURE DIVISION.
       LEAP.
         DIVIDE WS-YEAR BY 4 GIVING WS-QUOTIENT 
             REMAINDER WS-REMAINDER-4.

         DIVIDE WS-YEAR BY 100 GIVING WS-QUOTIENT
             REMAINDER WS-REMAINDER-100
    
         DIVIDE WS-YEAR BY 400 GIVING WS-QUOTIENT 
             REMAINDER WS-REMAINDER-400.
        
         IF WS-REMAINDER-4 = 0 AND WS-REMAINDER-100 = 1 THEN
           MOVE 1 TO WS-RESULT
         ELSE
           IF WS-REMAINDER-100 = 1 AND WS-REMAINDER-400 = 0 THEN
               MOVE 0 TO WS-RESULT
           ELSE
             MOVE 1 TO WS-RESULT
           END-IF
         END-IF.
         CONTINUE.
       LEAP-EXIT.
       EXIT.
